In [2]:
import pandas as pd
import datetime

In [3]:
df=pd.read_csv('vehicle_collisions.csv',sep=',')
df.head()

,UNIQUE KEY,DATE,TIME,BOROUGH,ZIP CODE,LATITUDE,LONGITUDE,LOCATION,ON STREET NAME,CROSS STREET NAME,...,VEHICLE 1 TYPE,VEHICLE 2 TYPE,VEHICLE 3 TYPE,VEHICLE 4 TYPE,VEHICLE 5 TYPE,VEHICLE 1 FACTOR,VEHICLE 2 FACTOR,VEHICLE 3 FACTOR,VEHICLE 4 FACTOR,VEHICLE 5 FACTOR
0,3146911,1/1/15,0:20,QUEENS,11358.0,40.751847,-73.787862,"(40.7518471, -73.787862)",47 AVENUE,193 STREET,...,SPORT UTILITY/STATION WAGON,NaN,NaN,NaN,NaN,TRAFFIC CONTROL DISREGARDED,NaN,NaN,NaN,NaN
1,3146180,1/1/15,0:20,NaN,NaN,40.771289,-73.946693,"(40.7712888, -73.9466928)",NaN,NaN,...,PASSENGER VEHICLE,NaN,NaN,NaN,NaN,ANIMALS ACTION,NaN,NaN,NaN,NaN
2,3146384,1/1/15,0:21,BROOKLYN,11205.0,40.689445,-73.955121,"(40.6894449, -73.9551212)",BEDFORD AVENUE,LAFAYETTE AVENUE,...,PASSENGER VEHICLE,UNKNOWN,NaN,NaN,NaN,FATIGUED/DROWSY,UNSPECIFIED,NaN,NaN,NaN
3,3146013,1/1/15,0:30,BROOKLYN,11213.0,40.673845,-73.925080,"(40.6738445, -73.9250801)",BUFFALO AVENUE,SAINT MARKS AVENUE,...,BUS,PASSENGER VEHICLE,NaN,NaN,NaN,LOST CONSCIOUSNESS,NaN,NaN,NaN,NaN
4,3146120,1/1/15,0:33,NaN,NaN,NaN,NaN,NaN,RICHMOND TERRACE,SOUTH AVENUE,...,UNKNOWN,PASSENGER VEHICLE,NaN,NaN,NaN,UNSPECIFIED,UNSPECIFIED,NaN,NaN,NaN

In [4]:
df['DATE'] = pd.to_datetime(df['DATE'])
ny_accident=df[(df['DATE']<"1/1/17")& (df['DATE']>"12/31/15")]
man_accident=df[(df['DATE']<"1/1/17")& (df['DATE']>"12/31/15")&(df['BOROUGH']=='MANHATTAN')]

In [5]:
pd.options.mode.chained_assignment = None #'warn'
ny_accident['MONTH']=ny_accident['DATE'].apply(lambda x : x.strftime("%b"))

In [6]:
man_accident['MONTH']=man_accident['DATE'].apply(lambda x : x.strftime("%b"))

In [7]:
ny_accident=ny_accident[['MONTH','DATE','BOROUGH','UNIQUE KEY']]
ny_count=pd.DataFrame(ny_accident.groupby(['MONTH']).size())
ny_count.head()

           0
MONTH
Apr    18331
Aug    19678
Dec    19214
Feb    15985
Jan    18101

In [8]:
man_accident=man_accident[['MONTH','DATE','BOROUGH','UNIQUE KEY']]
man_count=pd.DataFrame(man_accident.groupby(['MONTH']).size())
man_count.head()

          0
MONTH
Apr    3540
Aug    2844
Dec    2634
Feb    3195
Jan    3178

In [9]:
man_count.rename(columns={0: 'MANHATTAN'}, inplace=True)
ny_count.rename(columns={0: 'NYC'}, inplace=True)
percent_out=pd.concat([man_count, ny_count], axis=1, join='inner')

In [10]:
percent_out['PERCENTAGE']=percent_out['MANHATTAN']/percent_out['NYC']

In [11]:
percent_out.to_csv('Q1_Part_1_Output.csv')
percent_out.head()

       MANHATTAN    NYC  PERCENTAGE
MONTH
Apr         3540  18331    0.193115
Aug         2844  19678    0.144527
Dec         2634  19214    0.137088
Feb         3195  15985    0.199875
Jan         3178  18101    0.175570